//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef med_digitOutput_H
#define mde_digitOutput_H
//-----------------------------------------------------------------------------
#ifndef snail_data_types
    #include ".\depend\snail_data_types.h"
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//name:IO输出
//in: in_port_num,管脚号 从0开始。in_new_put 新状态, sdt_true 开启
//out: 
//-----------------------------------------------------------------------------
void mde_ouput_port(sdt_int8u in_port_num,sdt_bool in_new_put);
#endif
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++



