//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include ".\app_cfg.h"
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//name: 光栅测量
//-----------------------------------------------------------------------------
void app_grating_task(void)
{
    mde_gratingMeasure_task();    
}
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//5um的分辨率
#define resolution  5
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//-----------------------------------------------------------------------------
sdt_int32s app_pull_increment_um(void)
{
    sdt_int32s increment_pulse;
    mde_pull_differentPulse(0,&increment_pulse);
    return(increment_pulse*resolution);
}
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//name:
//out: sdt_false 没有复位零点
//-----------------------------------------------------------------------------
sdt_bool app_pull_site_um(sdt_int32s* out_site_um)
{
    sdt_int32s site_pulse;
    if(mde_pull_sitePulse(0,&site_pulse))
    {
        *out_site_um = site_pulse*resolution;
        return(sdt_true);
    }
    *out_site_um = 0;
    return(sdt_false);
}
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++